tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Terminal utilities and languages
brew 'htop'
brew 'exa'
brew 'fx'
brew 'neovim'
brew 'fd'
brew 'broot'
brew 'gping'
brew 'git'
brew 'coreutils'
brew 'bat'
brew 'mas'
brew 'tree'
brew 'ollama'

# Apps
cask 'docker'
cask 'phpstorm'
cask 'discord'
cask 'fork'
cask 'rectangle'
cask 'visual-studio-code'
cask 'iterm2'
cask 'battery'
cask 'firefox-developer-edition'
cask 'rapidapi'
cask 'balenaetcher'
cask 'google-chrome'
cask 'monitorcontrol'
cask 'figma'
cask 'openemu'
cask 'parsec'
cask 'transmission'
cask 'android-studio'
cask 'daisydisk'

# Apps from Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Pixelmator Pro', id: 1289583905
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Keynote', id: 409183694
mas 'iMovie', id: 408981434
mas 'iA Writer', id: 775737590
mas 'Things', id: 904280696
mas 'One Thing', id: 1604176982
mas 'WireGuard', id: 1451685025
mas 'Xcode', id: 497799835

# Fonts
cask 'font-fira-code-nerd-font'
