tap 'homebrew/cask'
tap 'nicoverbruggen/homebrew-cask'
tap 'homebrew/cask-fonts'

# Terminal utilities and languages
brew 'php'
brew 'htop'
brew 'exa'
brew 'fx'
brew 'neovim'
brew 'numi'
brew 'fd'
brew 'broot'
brew 'gping'
brew 'git'
brew 'coreutils'
brew 'bat'
brew 'composer'
brew 'nvm'
brew 'mas'

# Apps
cask 'docker'
cask 'phpstorm'
cask 'homebrew/cask-versions/firefox-developer-edition'
cask 'discord'
cask 'fork'
cask 'rectangle'
cask 'visual-studio-code'
cask 'phpmon'
cask 'iterm2'
cask 'monitor-control'
cask 'battery'
cask 'diffusionbee'
cask 'firefox-developer-edition'
cask 'arc'
cask 'jetbrains-toolbox'
cask 'paw'
cask 'notion'
cask 'balenaetcher'
cask 'mimestream'


# Apps from Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Pixelmator Pro', id: 1289583905
mas 'Numbers', id: 409203825
mas 'Xcode', id: 497799835
mas 'iA Writer', id: 775737590
mas 'Things', id: 904280696

# Fonts
cask 'font-fira-code-nerd-font'