tap 'homebrew/cask'
tap 'nicoverbruggen/homebrew-cask'
tap 'homebrew/cask-fonts'

# Terminal utilities and languages
brew 'php'
brew 'htop'
brew 'exa'
brew 'fx'
brew 'neovim'
brew 'numi'
brew 'fd'
brew 'broot'
brew 'gping'
brew 'git'
brew 'coreutils'
brew 'bat'
brew 'composer'
brew 'nvm'
brew 'mas'

# Apps
cask 'docker'
cask 'phpstorm'
cask 'homebrew/cask-versions/firefox-developer-edition'
cask 'brave-browser'
cask 'aldente'
cask 'discord'
cask 'fork'
cask 'rectangle'
cask 'slack'
cask 'visual-studio-code'
cask 'phpmon'
cask 'iterm2'
cask 'monitor-control'

# Apps from Mac App Store
mas 'Affinity Photo', id: 824183456
mas 'Affinity Designer', id: 824171161
mas 'Affinity Publisher', id: 881418622
mas 'Amphetamine', id: 937984704
mas 'Pixelmator Pro', id: 1289583905
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Keynote', id: 409183694
mas 'Xcode', id: 497799835

# Fonts
cask 'font-fira-code-nerd-font'